import { View } from "@tarojs/components";
import NavCustomBar from "$/components/NavCustomBar/nav";
import "./cr.scss";

export default function CommentRule() {
  return (
    <>
      <NavCustomBar mainTitle="社区规范" />
      <View className="cr-first-text">
        柠檬校园墙致力于为用户提供一个温暖、可信、友善、和谐的线上社区。为了维护社区秩序，保持良好氛围，柠檬团队将依据本规范中的条款对使用柠檬校园墙的用户和发布与柠檬校园墙上的内容进行管理。在收到用户举报或巡查发现违规行为时，柠檬团队将会根据对社区氛围破坏的程度，使用删除发布内容、暂停用户部分权限乃至终止用户使用柠檬校园墙的权利等措施进行管理。
      </View>
      <View className="cr-second-text">
        <View style={{ whiteSpace: "pre-wrap", fontWeight: 600 }}>
          违规行为的界定
        </View>
        <View style={{ whiteSpace: "pre-wrap" }}>
          1. 违反法律法规{"\n"}
          1.1 反对宪法所确定的基本原则{"\n"}
          1.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统{"\n"}
          1.3 损害国家荣誉和利益{"\n"}
          1.4 煽动民族仇恨、民族歧视，破坏民族团结{"\n"}
          1.5 侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的{"\n"}
          1.6 破坏国家宗教政策，宣扬邪教和封建迷信{"\n"}
          1.7 散布谣言，扰乱社会秩序，破坏社会稳定{"\n"}
          1.8 宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪{"\n"}
          1.9 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序{"\n"}
          1.10 泄露他人隐私，侵害他人的肖像权、姓名权或其他权益{"\n"}
          1.10.1 捏造事实或身份，诽谤他人，产生恶劣影响{"\n"}
          1.11 捏造、攻击、嘲讽、戏谑、传播历任及现任党和国家领导人相关敏感信息
          {"\n"}
          1.12 出租、出售、求购、传播翻墙相关软件或信息{"\n"}
          1.13 发布含有法律、行政法规禁止的其他内容的信息{"\n"}
          1.14 发布上级监管部门禁止的危害平台安全的信息{"\n"}2 违反校规{"\n"}
          2.1 发布出租或求租床位、校园卡、学生证、校内账号等信息{"\n"}
          2.2 发布征集或者提供代跑、代课、代考、代写作业、代签到等作弊信息{"\n"}
          2.3 盗用学校或学校部门、校内组织名义从事活动{"\n"}
          2.4 其他通过校友圈组织、参与、宣扬的违反校规的行为{"\n"}3 违反发帖要求
          {"\n"}
          3.1 发布帖子时未按照该分类的发帖要求提供必要信息{"\n"}
          3.2 发布求助类帖子时违反自查要求{"\n"}
          3.2.1 发布常见求助内容，但并未声明已善用搜索及发帖理由{"\n"}
          3.3 发布限制类帖子时违反自查要求{"\n"}
          3.3.1 发布的闲置价格高于原购入价格{"\n"}
          3.3.2 发布的闲置价格高于在其他平台的挂价{"\n"}
          3.3.3 发布不符合国家相关法律和社区规定类别的闲置{"\n"}
          3.3.4
          发布闲置时将书籍资料、美妆护肤、鞋服包饰等展示受限分类混入其他分类
          {"\n"}
          3.4 发布寻人类帖子时未说明来意或侵犯他人隐私{"\n"}
          3.5 拼单、拼车、游戏、自习、旅游、电影、聚餐或其他涉及{"\n"}
          3.6 发布帖子时错误分类或回避展示受限的分类{"\n"}
          3.7
          七天之内以同一账号、不同账号或跟帖等任意形式重复发布帖子（寻物招领类除外）
          {"\n"}
          3.8 宠物领养只允许无偿领养，禁止商家机构或个人进行宠物销售行为{"\n"}4
          不友善的行为{"\n"}
          4.1 轻蔑：贬低、轻视他人及其劳动成果{"\n"}
          4.2 诽谤：捏造、散布虚假事实，损害他人名誉{"\n"}
          4.3 嘲讽：以比喻夸张、侮辱性的文字或图像，戏谑调侃他人，令人产生不适
          {"\n"}
          4.4
          挑衅：以不友好的方式激怒他人，意图使对方对自己的言论作出回应，蓄意制造事端
          {"\n"}
          4.4.1 无根据地臆测他人的发言或行事动机，恶意引战{"\n"}
          4.5 羞辱：贬低他人的能力、行为、生理或身份特征，让对方难堪{"\n"}
          4.6 谩骂：以不文明的语言攻击他人或实体{"\n"}
          4.7
          歧视：针对他人的民族、种族、宗教、性取向、性别、年龄、地域、生理特征、疾病、专业等身份或者归类的攻击
          {"\n"}
          4.8 威胁：许诺以不良的后果来迫使他人服从自己的意志{"\n"}
          4.9 欺诈：通过编造身份或事实，谋取利益、引发混乱或哗众取宠{"\n"}
          4.10 剧透：在热门作品上映或播出期间，故意剧透{"\n"}5
          发布垃圾信息、广告信息{"\n"}
          5.1
          以商家、机构、微商、代理、代购、中介、黄牛、个体户、兼职、自由职业者等任何商业身份发布牟利或推广信息
          {"\n"}
          5.2 以所谓出售或出租闲置为名义的牟利行为{"\n"}
          5.2.1 出售可轻易免费领取的物品、票卡或资格{"\n"}
          5.2.2 批量出售家庭农产品{"\n"}
          5.2.3 批量出售自制手工艺品或服务{"\n"}
          5.2.4 盈利性质的出租行为{"\n"}
          5.3 有组织地以软文发布售卖产品、提供服务、宣传推广等内容的垃圾广告
          {"\n"}
          5.3.1 以消费者或用户等身份发布的软文钓鱼帖{"\n"}
          5.4 发布诱导用户点击、分享、点赞、集赞、评论、跳转、关{"\n"}
          5.5
          发布含有返利内容的推广链接、二维码等内容，返利范围包括金钱、积分、资格等
          {"\n"}
          5.6 发布非校内相关的活动信息{"\n"}
          5.7 通过快速发帖、回帖、发布无意义图文等行为干扰社区秩序和用户体验
          {"\n"}
          5.8 频繁回复过早时期的帖文，对他人造成干扰{"\n"}
          5.9 频繁私聊骚扰他人，干扰社区秩序{"\n"}
          5.10
          发布诸如投票、助力、加速、砍价、测试、点赞、总结等第三方病毒营销类信息
          {"\n"}
          5.11
          发布、转载或讨论极端动保主义、极端环保主义、极端男/女权主义、极端素食主义、饭圈等相关经典引战话题
          {"\n"}6 发布色情低俗信息{"\n"}
          6.1
          发布、索取、传播漏点图、性行为、性交易等相关色情图文、视频、网址等信息
          {"\n"}
          6.2 发布约炮或相关性暗示等违规交友内容{"\n"}
          6.2.1
          非匿名状态下表达交友、恋爱等需求或倾向，但无明确要求和足够信息，视作性暗示处理
          {"\n"}
          6.2.2 描述约炮、性虐待、性交易等经历或经验，视作性暗示处理{"\n"}
          6.3 发布细致描绘性行为或露骨自拍的内容{"\n"}
          6.4 发布血腥、恶俗、恐怖、自残等令人感到不适的低俗内容{"\n"}
          6.5 在匿名模式下交友，索取或暴露联系方式{"\n"}
          6.5.1 在匿名下交友，但采取捞人等方式规避匿名留联系方式{"\n"}7
          被禁止的违规闲置类别{"\n"}
          7.1 枪支弹药、管制刀具、易燃易爆品、毒品{"\n"}
          7.2 招嫖信息、原味衣物、烟草、电子烟{"\n"}
          7.3 发票、假证、假章、假冒商品、盗版内容、宠物、翻墙软件及服务{"\n"}
          7.4 试卷、作业、电子资料{"\n"}
          7.5 宠物{"\n"}8 其他被禁止的行为{"\n"}
          8.1 注册时上传虚假认证信息、冒用他人身份信息{"\n"}
          8.2 挑衅、侮辱谩骂平台客服或其他管理员，干扰平台管理工作{"\n"}
          用户违反社区规范后的处理{"\n"}
          视危害大小与违规次数的不同，用户违规后被暂停的用户权限和时长也不同。当用户被一定数量的用户举报，会被临时封禁1天，柠檬团队会根据用户行为选择解封或者进行正式的封禁操作.
          {"\n"}
          一般除违反发帖要求以外的违规行为，起始封禁时长为7或30天，高度政治敏感和恶劣商业行为360天起。所有同类违规行为累犯时，封禁时长增加一级，封禁时长共5档：1
          {"\n"}
          天，7天，30天，360天，永久封禁，依次递增。 封禁的等级目前分为4个级别：
          {"\n"}
          1级封禁禁止发帖、攒局{"\n"}
          2级封禁禁止发帖、攒局、评论{"\n"}
          3级封禁禁止修改头像、昵称、学校，禁止评论、发帖、攒局、私聊{"\n"}
          5级无法使用小程序（封号）{"\n"}
          大部分违规行为后的起始封禁等级集中在2级和3级，政治敏感和色情信息及其他恶性行为的起始封禁等级为5级。
          {"\n"}
          当用户被封禁后，会被告知处理原因，并有权利提出申诉{"\n"}
          柠檬团队将通过后台于工作日时进行沟通。{"\n"}
          柠檬校园墙还在发展，受人力所限，对于社区的管理无法做到尽善尽美。我们十分欢迎每一位朵友的监督，善用举报功能，共同建设和谐友善的社区氛围。
          {"\n"}
          柠檬校园墙对以上内容保留最终解释权。{"\n"}
        </View>
      </View>
    </>
  );
}
